name: "ensemble_phone_detection"
platform: "ensemble"
max_batch_size: 4

input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

output [
  {
    name: "PERSON_ID"
    data_type: TYPE_INT32
    dims: [ 1 ]
  },
  {
    name: "IS_PHONE"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  },
  {
    name: "CONFIDENCE"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step: [
    {
      model_name: "preprocess_img"
      model_version: 1
      input_map {
        key: "INPUT_IMAGE"
        value: "INPUT_IMAGE"
      }
      output_map {
        key: "PROCESSED_IMAGE"
        value: "processed_image"
      }
    },
    {
      model_name: "rtmdet_detection"
      model_version: 1
      input_map {
        key: "input"
        value: "processed_image"
      }
      output_map {
        key: "dets"
        value: "detections"
      }
      output_map {
        key: "labels"
        value: "detection_labels"
      }
    },
    {
      model_name: "person_cropper"
      model_version: 1
      input_map {
        key: "image"
        value: "processed_image"
      }
      input_map {
        key: "dets"
        value: "detections"
      }
      input_map {
        key: "labels"
        value: "detection_labels"
      }
      output_map {
        key: "cropped_person"
        value: "cropped_person"
      }
    },
    {
      model_name: "rtmpose_estimation"
      model_version: 1
      input_map {
        key: "input"
        value: "cropped_person"
      }
      output_map {
        key: "simcc_x"
        value: "pose_x"
      }
      output_map {
        key: "simcc_y"
        value: "pose_y"
      }
    },
    {
      model_name: "feature_normalizer"
      model_version: 1
      input_map {
        key: "simcc_x"
        value: "pose_x"
      }
      input_map {
        key: "simcc_y"
        value: "pose_y"
      }
      output_map {
        key: "normalized_features"
        value: "normalized_features"
      }
    },
    {
      model_name: "mlp_phone_detector"
      model_version: 1
      input_map {
        key: "input"
        value: "normalized_features"
      }
      output_map {
        key: "output"
        value: "model_logits"
      }
    },
    {
      model_name: "postprocess"
      model_version: 1
      input_map {
        key: "MODEL_OUTPUT"
        value: "model_logits"
      }
      output_map {
        key: "PERSON_ID"
        value: "PERSON_ID"
      }
      output_map {
        key: "IS_PHONE"
        value: "IS_PHONE"
      }
      output_map {
        key: "CONFIDENCE"
        value: "CONFIDENCE"
      }
    }
  ]
}