name: "ensemble_phone_detection"
platform: "ensemble"
max_batch_size: 4

input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

output [
  {
    name: "PERSON_ID"
    data_type: TYPE_INT32
    dims: [ 1 ]
  },
  {
    name: "IS_PHONE"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  },
  {
    name: "CONFIDENCE"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: 1
      input_map {
        key: "INPUT_IMAGE"
        value: "INPUT_IMAGE"
      }
      output_map {
        key: "NORMALIZED_FEATURES"
        value: "normalized_features"
      }
    },
    {
      model_name: "mlp_phone_detector"
      model_version: 1
      input_map {
        key: "input"
        value: "normalized_features"
      }
      output_map {
        key: "output"
        value: "model_logits"
      }
    },
    {
      model_name: "postprocess"
      model_version: 1
      input_map {
        key: "MODEL_OUTPUT"
        value: "model_logits"
      }
      output_map {
        key: "PERSON_ID"
        value: "PERSON_ID"
      }
      output_map {
        key: "IS_PHONE"
        value: "IS_PHONE"
      }
      output_map {
        key: "CONFIDENCE"
        value: "CONFIDENCE"
      }
    }
  ]
}